Revit 2021.1 API
EditScope Properties
The EditScope type exposes the following members.
Properties
Name | Description
IsActive
 Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
EditScope Class
Autodesk.Revit.DB Namespace